#!/usr/bin/env bash

################################################################################
#
# Author					: iaiting
# Generate Date		: 2018-06-25
# Email						: iaiting@aliyun.com
# Description			: 时间相关的shell脚本库函数
#
################################################################################

if [ `echo ${BASH_SOURCE[0]} | grep -c "/"` -gt 0 ]; then
    cd ${BASH_SOURCE[0]%/*}
fi

if [ "X${D_TIME_SH_}" != "X" ]; then
    return
fi

export D_TIME_SH_="time.sh"


################################################################################
#
# 函数名					: get_ymdhms
# 函数描述				: 获取系统中当前的 年-月-日 时-分-秒
# 入参						: nil
# 返回值					: 2018-06-25 00:00:00
#
################################################################################

function get_ymdhms() {

    typeset rv=`date +"%Y-%m-%d %H:%M:%S"`

    echo ${rv}

}

################################################################################
#
# 函数名					: get_ymd
# 函数描述				: 获取系统中当前的 年-月-日
# 入参						: nil
# 返回值					: 2018-06-25
#
################################################################################

function get_ymd() {

    typeset rv=`date +"%Y-%m-%d"`

    echo ${rv}

}

################################################################################
#
# 函数名					: get_ymd
# 函数描述				: 获取系统中当前的 时-分-秒
# 入参						: nil
# 返回值					: 01:01:01
#
################################################################################

 function get_hms() {

    typeset rv=`date +"%H:%M:%S"`

    echo ${rv}

}


################################################################################
#
# 函数名					: TEST_TIME
# 函数描述				: time.sh脚本文件的测试函数接口
# 入参						: TEST_TIME "test"
# 返回值					: nil
#
################################################################################

function TEST_TIME() {
    if [ $# -ne 1 ]; then
        return
    fi

    if [ "$1" != "timetest" ]; then
        return
    fi

    typeset ymdhms=`get_ymdhms`
    echo "${ymdhms}"

    typeset ymd=`get_ymd`
    echo "${ymd}"

    typeset hms=`get_hms`
    echo "${hms}"

}

################################################################################
TEST_TIME "$@"

